import React from 'react';
import { Link } from 'react-router-dom';
import './PrivacyPolicy.css';

const PrivacyPolicy = () => {
  return (
    <div className="privacy-policy-container">
      <h1>Политика обработки персональных данных</h1>

      <h2>1. Общие положения</h2>
      <p>1.1. Политика в отношении обработки персональных данных (далее — Политика) направлена на защиту прав и свобод физических лиц, персональные данные которых обрабатывает ИП Зимницкая Зоя Владимировна (далее оператор).</p>
      <p>1.2. Политика разработана в соответствии с п. 2 ч. 1 ст. 18.1 Федерального закона от 27 июля 2006 г. № 152-ФЗ «О персональных данных» (далее — ФЗ «О персональных данных»).</p>
      <p>1.3. Политика содержит сведения, подлежащие раскрытию в соответствии с ч. 1 ст. 14 ФЗ «О персональных данных», и является общедоступным документом.</p>

      <h2>2. Сведения об операторе</h2>
      <p>2.1. Оператор ИНН 780218837260</p>

      <h2>3. Сведения об обработке персональных данных</h2>
      <p>3.1. Оператор обрабатывает персональные данные на законной и справедливой основе для выполнения возложенных законодательством функций, полномочий и обязанностей, осуществления прав и законных интересов Оператора, работников Оператора и третьих лиц.</p>
      <p>3.2. Оператор получает персональные данные непосредственно у субъектов персональных данных.</p>
      <p>3.3. Оператор обрабатывает персональные данные автоматизированным и неавтоматизированным способами, с использованием средств вычислительной техники и без использования таких средств.</p>
      <p>3.4. Действия по обработке персональных данных включают сбор, запись, систематизацию, накопление, хранение, уточнение (обновление, изменение), извлечение, использование, передачу (распространение, предоставление, доступ), обезличивание, блокирование, удаление и уничтожение.</p>
      <p>3.5. Базы данных информации, содержащей персональные данные граждан Российской Федерации, находятся на территории Российской Федерации.</p>

      <h2>4. Обработка персональных данных соискателей</h2>
      <p>4.1. Оператор обрабатывает персональные данные соискателей вакантных должностей (далее — соискателей).</p>
      <p>4.2. Оператор обрабатывает персональные данные соискателей с целью:</p>
      <ul>
        <li>принимать решения о приёме либо отказе в приёме на работу;</li>
        <li>вести кадровый резерв.</li>
      </ul>
      <p>4.3. Оператор обрабатывает персональные данные соискателей с их письменного согласия, предоставляемого на срок, необходимый для принятия решения о приеме либо отказе в приеме на работу. Исключение составляют случаи при самостоятельном размещении соискателем своего резюме, доступного неограниченному кругу лиц, в сети Интернет.</p>
      <p>4.4. Оператор обрабатывает персональные данные соискателей в течение срока, необходимого для принятия решения о приеме либо отказе в приеме на работу. В случае отказа в приеме на работу Оператор прекращает обработку персональных данных соискателя в течение 30 дней в соответствии с ч. 4 ст. 21 ФЗ «О персональных данных». Если соискатель предоставил согласие на внесение его в кадровый резерв, Оператор может продолжить обработку персональных данных в течение срока, указанного в согласии.</p>
      <p>4.5. Оператор не обрабатывает специальные категории персональных данных соискателей и биометрические персональные данные соискателей.</p>
      <p>4.6. Оператор обрабатывает следующие персональные данные соискателей:</p>
      <ul>
        <li>Фамилия, имя, отчество;</li>
        <li>Тип, серия и номер документа, удостоверяющего личность;</li>
        <li>Дата выдачи документа, удостоверяющего личность, и информация о выдавшем его органе;</li>
        <li>Год, месяц, дата и место рождения;</li>
        <li>Адрес;</li>
        <li>Номер контактного телефона;</li>
        <li>Адрес электронной почты;</li>
        <li>Идентификационный номер налогоплательщика;</li>
        <li>Фотография;</li>
        <li>Образование, профессия, доходы, сведения об оказанных услугах.</li>
      </ul>

      <h2>5. Обработка персональных данных клиентов</h2>
      <p>5.1. Оператор обрабатывает персональные данные клиентов в рамках правоотношений с Оператором, урегулированных частью второй Гражданского Кодекса Российской Федерации от 26 января 1996 г. № 14-ФЗ, (далее — клиентов).</p>
      <p>5.2. Оператор обрабатывает персональные данные клиентов в целях соблюдения норм законодательства РФ, а также с целью:</p>
      <ul>
        <li>заключать и выполнять обязательства по договорам с клиентами;</li>
        <li>осуществлять виды деятельности, предусмотренные учредительными документами Оператора;</li>
        <li>информировать о новых товарах, специальных акциях и предложениях.</li>
      </ul>
      <p>5.3. Оператор обрабатывает персональные данные клиентов с их согласия, предоставляемого на срок действия заключенных с ними договоров.</p>
      <p>5.4. Оператор обрабатывает персональные данные клиентов в течение сроков действия заключенных с ними договоров.</p>

      <h2>6. Сведения об обеспечении безопасности персональных данных</h2>
      <p>6.1. Оператор назначает ответственного за организацию обработки персональных данных для выполнения обязанностей, предусмотренных ФЗ «О персональных данных» и принятыми в соответствии с ним нормативными правовыми актами.</p>
      <p>6.2. Оператор применяет комплекс правовых, организационных и технических мер по обеспечению безопасности персональных данных для обеспечения конфиденциальности персональных данных и их защиты от неправомерных действий.</p>

      <h2>7. Права субъектов персональных данных</h2>
      <p>7.1. Субъект персональных данных имеет право:</p>
      <ul>
        <li>на получение персональных данных, относящихся к данному субъекту, и информации, касающейся их обработки;</li>
        <li>на уточнение, блокирование или уничтожение его персональных данных в случае, если они являются неполными, устаревшими, неточными, незаконно полученными или не являются необходимыми для заявленной цели обработки;</li>
        <li>на отзыв данного им согласия на обработку персональных данных;</li>
        <li>на защиту своих прав и законных интересов, в том числе на возмещение убытков и компенсацию морального вреда в судебном порядке;</li>
        <li>на обжалование действий или бездействия Оператора в уполномоченный орган по защите прав субъектов персональных данных или в судебном порядке.</li>
      </ul>
      <p>7.2. Для реализации своих прав и законных интересов субъекты персональных данных имеют право обратиться к Оператору либо направить запрос лично или с помощью представителя. Запрос должен содержать сведения, указанные в ч. 3 ст. 14 ФЗ «О персональных данных».</p>

      {/* "Return Back" link */}
      <div className="back-link-container">
        <Link to="/">← Вернуться назад</Link>
      </div>
    </div>
  );
};

export default PrivacyPolicy;